Revit 2026 API

# CurveIntersect(Curve, CurveIntersectResultOption) Method

---

Calculates the intersection of this curve with the specified curve.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public CurveIntersectResult Intersect(
	Curve curve,
	CurveIntersectResultOption option
)
```
```vb
Public Function Intersect (
	curve As Curve,
	option As CurveIntersectResultOption
) As CurveIntersectResult
```
```cpp
public:
CurveIntersectResult^ Intersect(
	Curve^ curve,
	CurveIntersectResultOption option
)
```
```fsharp
member Intersect :
        curve : Curve *
        option : CurveIntersectResultOption -> CurveIntersectResult
```

#### Parameters

curve Curve
    The specified curve to intersect with this curve.
option CurveIntersectResultOption
    Specifies the amount of information to return in the CurveIntersectResult.

#### Return Value

CurveIntersectResultThe CurveIntersectResult describing the geometric relationship of the two curves. This will contain at least a SetComparisonResult and, if requested, a list of CurveOverlapPoints specifying where the two curves overlap or intersect.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | The specified curve is . |
| InvalidOperationException | Failed to calculate the intersection. |

The CurveIntersectResultOption passed to this method determines the amount of information that will be calculated and returned:

  * CurveIntersectResultOption.Simple - Calculate only the geometric relationship between the two curves, as indicated by a SetComparisonResult value.
  * CurveIntersectResultOption.Detailed - Calculate the geometric relationship between the two curves, along with any points or intervals of overlap. This option may result in additional computations being performed compared to CurveIntersectResultOption.Simple.

#### Reference

Curve Class

Intersect Overload

Autodesk.Revit.DB Namespace